app/controllers/comments_controller.rb

    def create
      @entry.comments.create!(comment_params)
---
INSERT INTO "comments" ("author", "comment", "entry_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Pablo A"], ["comment", "Este sería un comentario"], ["entry_id", 2], ["created_at", "2018-04-02 20:09:00.323467"], ["updated_at", "2018-04-02 20:09:00.323467"]]

    def update
      @comment.update(comment_params)
---
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "Nueva actualizacion"], ["updated_at", "2018-04-02 20:09:55.278813"], ["id", 2]]

    def set_entry
      @entry = Entry.find(params[:entry_id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_entry_comment
      @comment = @entry.comments.find_by!(id: params[:id]) if @entry
---
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["entry_id", 2], ["id", 2], ["LIMIT", 1]]