app/controllers/entries_controller.rb

    def index
      @entries = Entry.all
---
SELECT "entries".* FROM "entries"

    def create
      @entry = Entry.create!(entry_params)
---
INSERT INTO "entries" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Titulo 1"], ["subtitle", "Subtítulo 1"], ["body", "Este es el cuerpo"], ["created_at", "2018-04-02 19:55:51.810643"], ["updated_at", "2018-04-02 19:55:51.810643"]]

    def set_entry
      @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]